# HasDisplayStyle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..HasDisplayStyle Method
View Class See Also
---
Indicates if view has a DisplayStyle property
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasDisplayStyle()
```

Visual Basic
---
```text
Public Function HasDisplayStyle As Boolean
```

Visual C++
---
```text
public:
bool HasDisplayStyle()
```

# ### Return Value
True if view has a DisplayStyle property
# See Also
View Class
Autodesk.Revit.DB Namespace